MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx564f064h.h
extern volatile __C1RXF3bits_t C1RXF3bits __asm__ ("C1RXF3") __attribute__((section("sfrs"), address(0xBF88B170)));
extern volatile uint32_t        C1RXF3CLR __attribute__((section("sfrs"),address(0xBF88B174)));
extern volatile uint32_t        C1RXF3SET __attribute__((section("sfrs"),address(0xBF88B178)));
extern volatile uint32_t        C1RXF3INV __attribute__((section("sfrs"),address(0xBF88B17C)));
#define C1RXF4 C1RXF4
extern volatile uint32_t   C1RXF4 __attribute__((section("sfrs"), address(0xBF88B180)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF4bits_t;
extern volatile __C1RXF4bits_t C1RXF4bits __asm__ ("C1RXF4") __attribute__((section("sfrs"), address(0xBF88B180)));
extern volatile uint32_t        C1RXF4CLR __attribute__((section("sfrs"),address(0xBF88B184)));
extern volatile uint32_t        C1RXF4SET __attribute__((section("sfrs"),address(0xBF88B188)));
extern volatile uint32_t        C1RXF4INV __attribute__((section("sfrs"),address(0xBF88B18C)));
#define C1RXF5 C1RXF5
extern volatile uint32_t   C1RXF5 __attribute__((section("sfrs"), address(0xBF88B190)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF5bits_t;
extern volatile __C1RXF5bits_t C1RXF5bits __asm__ ("C1RXF5") __attribute__((section("sfrs"), address(0xBF88B190)));
extern volatile uint32_t        C1RXF5CLR __attribute__((section("sfrs"),address(0xBF88B194)));
extern volatile uint32_t        C1RXF5SET __attribute__((section("sfrs"),address(0xBF88B198)));
extern volatile uint32_t        C1RXF5INV __attribute__((section("sfrs"),address(0xBF88B19C)));
#define C1RXF6 C1RXF6
extern volatile uint32_t   C1RXF6 __attribute__((section("sfrs"), address(0xBF88B1A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF6bits_t;
extern volatile __C1RXF6bits_t C1RXF6bits __asm__ ("C1RXF6") __attribute__((section("sfrs"), address(0xBF88B1A0)));
extern volatile uint32_t        C1RXF6CLR __attribute__((section("sfrs"),address(0xBF88B1A4)));
extern volatile uint32_t        C1RXF6SET __attribute__((section("sfrs"),address(0xBF88B1A8)));
extern volatile uint32_t        C1RXF6INV __attribute__((section("sfrs"),address(0xBF88B1AC)));
#define C1RXF7 C1RXF7
extern volatile uint32_t   C1RXF7 __attribute__((section("sfrs"), address(0xBF88B1B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF7bits_t;
extern volatile __C1RXF7bits_t C1RXF7bits __asm__ ("C1RXF7") __attribute__((section("sfrs"), address(0xBF88B1B0)));
extern volatile uint32_t        C1RXF7CLR __attribute__((section("sfrs"),address(0xBF88B1B4)));
extern volatile uint32_t        C1RXF7SET __attribute__((section("sfrs"),address(0xBF88B1B8)));
extern volatile uint32_t        C1RXF7INV __attribute__((section("sfrs"),address(0xBF88B1BC)));
#define C1RXF8 C1RXF8
extern volatile uint32_t   C1RXF8 __attribute__((section("sfrs"), address(0xBF88B1C0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF8bits_t;
extern volatile __C1RXF8bits_t C1RXF8bits __asm__ ("C1RXF8") __attribute__((section("sfrs"), address(0xBF88B1C0)));
extern volatile uint32_t        C1RXF8CLR __attribute__((section("sfrs"),address(0xBF88B1C4)));
extern volatile uint32_t        C1RXF8SET __attribute__((section("sfrs"),address(0xBF88B1C8)));
extern volatile uint32_t        C1RXF8INV __attribute__((section("sfrs"),address(0xBF88B1CC)));
#define C1RXF9 C1RXF9
extern volatile uint32_t   C1RXF9 __attribute__((section("sfrs"), address(0xBF88B1D0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF9bits_t;
extern volatile __C1RXF9bits_t C1RXF9bits __asm__ ("C1RXF9") __attribute__((section("sfrs"), address(0xBF88B1D0)));
extern volatile uint32_t        C1RXF9CLR __attribute__((section("sfrs"),address(0xBF88B1D4)));
extern volatile uint32_t        C1RXF9SET __attribute__((section("sfrs"),address(0xBF88B1D8)));
extern volatile uint32_t        C1RXF9INV __attribute__((section("sfrs"),address(0xBF88B1DC)));
#define C1RXF10 C1RXF10
extern volatile uint32_t   C1RXF10 __attribute__((section("sfrs"), address(0xBF88B1E0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF10bits_t;
extern volatile __C1RXF10bits_t C1RXF10bits __asm__ ("C1RXF10") __attribute__((section("sfrs"), address(0xBF88B1E0)));
extern volatile uint32_t        C1RXF10CLR __attribute__((section("sfrs"),address(0xBF88B1E4)));
extern volatile uint32_t        C1RXF10SET __attribute__((section("sfrs"),address(0xBF88B1E8)));
extern volatile uint32_t        C1RXF10INV __attribute__((section("sfrs"),address(0xBF88B1EC)));
#define C1RXF11 C1RXF11
extern volatile uint32_t   C1RXF11 __attribute__((section("sfrs"), address(0xBF88B1F0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF11bits_t;
extern volatile __C1RXF11bits_t C1RXF11bits __asm__ ("C1RXF11") __attribute__((section("sfrs"), address(0xBF88B1F0)));
extern volatile uint32_t        C1RXF11CLR __attribute__((section("sfrs"),address(0xBF88B1F4)));
extern volatile uint32_t        C1RXF11SET __attribute__((section("sfrs"),address(0xBF88B1F8)));
extern volatile uint32_t        C1RXF11INV __attribute__((section("sfrs"),address(0xBF88B1FC)));
#define C1RXF12 C1RXF12
extern volatile uint32_t   C1RXF12 __attribute__((section("sfrs"), address(0xBF88B200)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF12bits_t;
extern volatile __C1RXF12bits_t C1RXF12bits __asm__ ("C1RXF12") __attribute__((section("sfrs"), address(0xBF88B200)));
extern volatile uint32_t        C1RXF12CLR __attribute__((section("sfrs"),address(0xBF88B204)));
extern volatile uint32_t        C1RXF12SET __attribute__((section("sfrs"),address(0xBF88B208)));
extern volatile uint32_t        C1RXF12INV __attribute__((section("sfrs"),address(0xBF88B20C)));
#define C1RXF13 C1RXF13
extern volatile uint32_t   C1RXF13 __attribute__((section("sfrs"), address(0xBF88B210)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF13bits_t;
extern volatile __C1RXF13bits_t C1RXF13bits __asm__ ("C1RXF13") __attribute__((section("sfrs"), address(0xBF88B210)));
extern volatile uint32_t        C1RXF13CLR __attribute__((section("sfrs"),address(0xBF88B214)));
extern volatile uint32_t        C1RXF13SET __attribute__((section("sfrs"),address(0xBF88B218)));
extern volatile uint32_t        C1RXF13INV __attribute__((section("sfrs"),address(0xBF88B21C)));
#define C1RXF14 C1RXF14
extern volatile uint32_t   C1RXF14 __attribute__((section("sfrs"), address(0xBF88B220)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF14bits_t;
extern volatile __C1RXF14bits_t C1RXF14bits __asm__ ("C1RXF14") __attribute__((section("sfrs"), address(0xBF88B220)));
extern volatile uint32_t        C1RXF14CLR __attribute__((section("sfrs"),address(0xBF88B224)));
extern volatile uint32_t        C1RXF14SET __attribute__((section("sfrs"),address(0xBF88B228)));
extern volatile uint32_t        C1RXF14INV __attribute__((section("sfrs"),address(0xBF88B22C)));
#define C1RXF15 C1RXF15
extern volatile uint32_t   C1RXF15 __attribute__((section("sfrs"), address(0xBF88B230)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF15bits_t;
