MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx564f064h.h
extern volatile __C1FIFOCON19bits_t C1FIFOCON19bits __asm__ ("C1FIFOCON19") __attribute__((section("sfrs"), address(0xBF88B810)));
extern volatile uint32_t        C1FIFOCON19CLR __attribute__((section("sfrs"),address(0xBF88B814)));
extern volatile uint32_t        C1FIFOCON19SET __attribute__((section("sfrs"),address(0xBF88B818)));
extern volatile uint32_t        C1FIFOCON19INV __attribute__((section("sfrs"),address(0xBF88B81C)));
#define C1FIFOINT19 C1FIFOINT19
extern volatile uint32_t   C1FIFOINT19 __attribute__((section("sfrs"), address(0xBF88B820)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT19bits_t;
extern volatile __C1FIFOINT19bits_t C1FIFOINT19bits __asm__ ("C1FIFOINT19") __attribute__((section("sfrs"), address(0xBF88B820)));
extern volatile uint32_t        C1FIFOINT19CLR __attribute__((section("sfrs"),address(0xBF88B824)));
extern volatile uint32_t        C1FIFOINT19SET __attribute__((section("sfrs"),address(0xBF88B828)));
extern volatile uint32_t        C1FIFOINT19INV __attribute__((section("sfrs"),address(0xBF88B82C)));
#define C1FIFOUA19 C1FIFOUA19
extern volatile uint32_t   C1FIFOUA19 __attribute__((section("sfrs"), address(0xBF88B830)));
extern volatile uint32_t        C1FIFOUA19CLR __attribute__((section("sfrs"),address(0xBF88B834)));
extern volatile uint32_t        C1FIFOUA19SET __attribute__((section("sfrs"),address(0xBF88B838)));
extern volatile uint32_t        C1FIFOUA19INV __attribute__((section("sfrs"),address(0xBF88B83C)));
#define C1FIFOCI19 C1FIFOCI19
extern volatile uint32_t   C1FIFOCI19 __attribute__((section("sfrs"), address(0xBF88B840)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI19bits_t;
extern volatile __C1FIFOCI19bits_t C1FIFOCI19bits __asm__ ("C1FIFOCI19") __attribute__((section("sfrs"), address(0xBF88B840)));
extern volatile uint32_t        C1FIFOCI19CLR __attribute__((section("sfrs"),address(0xBF88B844)));
extern volatile uint32_t        C1FIFOCI19SET __attribute__((section("sfrs"),address(0xBF88B848)));
extern volatile uint32_t        C1FIFOCI19INV __attribute__((section("sfrs"),address(0xBF88B84C)));
#define C1FIFOCON20 C1FIFOCON20
extern volatile uint32_t   C1FIFOCON20 __attribute__((section("sfrs"), address(0xBF88B850)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON20bits_t;
extern volatile __C1FIFOCON20bits_t C1FIFOCON20bits __asm__ ("C1FIFOCON20") __attribute__((section("sfrs"), address(0xBF88B850)));
extern volatile uint32_t        C1FIFOCON20CLR __attribute__((section("sfrs"),address(0xBF88B854)));
extern volatile uint32_t        C1FIFOCON20SET __attribute__((section("sfrs"),address(0xBF88B858)));
extern volatile uint32_t        C1FIFOCON20INV __attribute__((section("sfrs"),address(0xBF88B85C)));
#define C1FIFOINT20 C1FIFOINT20
extern volatile uint32_t   C1FIFOINT20 __attribute__((section("sfrs"), address(0xBF88B860)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT20bits_t;
extern volatile __C1FIFOINT20bits_t C1FIFOINT20bits __asm__ ("C1FIFOINT20") __attribute__((section("sfrs"), address(0xBF88B860)));
extern volatile uint32_t        C1FIFOINT20CLR __attribute__((section("sfrs"),address(0xBF88B864)));
extern volatile uint32_t        C1FIFOINT20SET __attribute__((section("sfrs"),address(0xBF88B868)));
extern volatile uint32_t        C1FIFOINT20INV __attribute__((section("sfrs"),address(0xBF88B86C)));
#define C1FIFOUA20 C1FIFOUA20
extern volatile uint32_t   C1FIFOUA20 __attribute__((section("sfrs"), address(0xBF88B870)));
extern volatile uint32_t        C1FIFOUA20CLR __attribute__((section("sfrs"),address(0xBF88B874)));
extern volatile uint32_t        C1FIFOUA20SET __attribute__((section("sfrs"),address(0xBF88B878)));
extern volatile uint32_t        C1FIFOUA20INV __attribute__((section("sfrs"),address(0xBF88B87C)));
#define C1FIFOCI20 C1FIFOCI20
extern volatile uint32_t   C1FIFOCI20 __attribute__((section("sfrs"), address(0xBF88B880)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI20bits_t;
extern volatile __C1FIFOCI20bits_t C1FIFOCI20bits __asm__ ("C1FIFOCI20") __attribute__((section("sfrs"), address(0xBF88B880)));
extern volatile uint32_t        C1FIFOCI20CLR __attribute__((section("sfrs"),address(0xBF88B884)));
extern volatile uint32_t        C1FIFOCI20SET __attribute__((section("sfrs"),address(0xBF88B888)));
extern volatile uint32_t        C1FIFOCI20INV __attribute__((section("sfrs"),address(0xBF88B88C)));
#define C1FIFOCON21 C1FIFOCON21
extern volatile uint32_t   C1FIFOCON21 __attribute__((section("sfrs"), address(0xBF88B890)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON21bits_t;
extern volatile __C1FIFOCON21bits_t C1FIFOCON21bits __asm__ ("C1FIFOCON21") __attribute__((section("sfrs"), address(0xBF88B890)));
extern volatile uint32_t        C1FIFOCON21CLR __attribute__((section("sfrs"),address(0xBF88B894)));
extern volatile uint32_t        C1FIFOCON21SET __attribute__((section("sfrs"),address(0xBF88B898)));
extern volatile uint32_t        C1FIFOCON21INV __attribute__((section("sfrs"),address(0xBF88B89C)));
#define C1FIFOINT21 C1FIFOINT21
extern volatile uint32_t   C1FIFOINT21 __attribute__((section("sfrs"), address(0xBF88B8A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT21bits_t;
extern volatile __C1FIFOINT21bits_t C1FIFOINT21bits __asm__ ("C1FIFOINT21") __attribute__((section("sfrs"), address(0xBF88B8A0)));
extern volatile uint32_t        C1FIFOINT21CLR __attribute__((section("sfrs"),address(0xBF88B8A4)));
extern volatile uint32_t        C1FIFOINT21SET __attribute__((section("sfrs"),address(0xBF88B8A8)));
extern volatile uint32_t        C1FIFOINT21INV __attribute__((section("sfrs"),address(0xBF88B8AC)));
#define C1FIFOUA21 C1FIFOUA21
extern volatile uint32_t   C1FIFOUA21 __attribute__((section("sfrs"), address(0xBF88B8B0)));
extern volatile uint32_t        C1FIFOUA21CLR __attribute__((section("sfrs"),address(0xBF88B8B4)));
extern volatile uint32_t        C1FIFOUA21SET __attribute__((section("sfrs"),address(0xBF88B8B8)));
extern volatile uint32_t        C1FIFOUA21INV __attribute__((section("sfrs"),address(0xBF88B8BC)));
#define C1FIFOCI21 C1FIFOCI21
extern volatile uint32_t   C1FIFOCI21 __attribute__((section("sfrs"), address(0xBF88B8C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI21bits_t;
extern volatile __C1FIFOCI21bits_t C1FIFOCI21bits __asm__ ("C1FIFOCI21") __attribute__((section("sfrs"), address(0xBF88B8C0)));
extern volatile uint32_t        C1FIFOCI21CLR __attribute__((section("sfrs"),address(0xBF88B8C4)));
extern volatile uint32_t        C1FIFOCI21SET __attribute__((section("sfrs"),address(0xBF88B8C8)));
extern volatile uint32_t        C1FIFOCI21INV __attribute__((section("sfrs"),address(0xBF88B8CC)));
#define C1FIFOCON22 C1FIFOCON22
extern volatile uint32_t   C1FIFOCON22 __attribute__((section("sfrs"), address(0xBF88B8D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON22bits_t;
extern volatile __C1FIFOCON22bits_t C1FIFOCON22bits __asm__ ("C1FIFOCON22") __attribute__((section("sfrs"), address(0xBF88B8D0)));
extern volatile uint32_t        C1FIFOCON22CLR __attribute__((section("sfrs"),address(0xBF88B8D4)));
extern volatile uint32_t        C1FIFOCON22SET __attribute__((section("sfrs"),address(0xBF88B8D8)));
extern volatile uint32_t        C1FIFOCON22INV __attribute__((section("sfrs"),address(0xBF88B8DC)));
#define C1FIFOINT22 C1FIFOINT22
extern volatile uint32_t   C1FIFOINT22 __attribute__((section("sfrs"), address(0xBF88B8E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT22bits_t;
extern volatile __C1FIFOINT22bits_t C1FIFOINT22bits __asm__ ("C1FIFOINT22") __attribute__((section("sfrs"), address(0xBF88B8E0)));
extern volatile uint32_t        C1FIFOINT22CLR __attribute__((section("sfrs"),address(0xBF88B8E4)));
extern volatile uint32_t        C1FIFOINT22SET __attribute__((section("sfrs"),address(0xBF88B8E8)));
extern volatile uint32_t        C1FIFOINT22INV __attribute__((section("sfrs"),address(0xBF88B8EC)));
#define C1FIFOUA22 C1FIFOUA22
extern volatile uint32_t   C1FIFOUA22 __attribute__((section("sfrs"), address(0xBF88B8F0)));
extern volatile uint32_t        C1FIFOUA22CLR __attribute__((section("sfrs"),address(0xBF88B8F4)));
extern volatile uint32_t        C1FIFOUA22SET __attribute__((section("sfrs"),address(0xBF88B8F8)));
extern volatile uint32_t        C1FIFOUA22INV __attribute__((section("sfrs"),address(0xBF88B8FC)));
#define C1FIFOCI22 C1FIFOCI22
extern volatile uint32_t   C1FIFOCI22 __attribute__((section("sfrs"), address(0xBF88B900)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI22bits_t;
extern volatile __C1FIFOCI22bits_t C1FIFOCI22bits __asm__ ("C1FIFOCI22") __attribute__((section("sfrs"), address(0xBF88B900)));
extern volatile uint32_t        C1FIFOCI22CLR __attribute__((section("sfrs"),address(0xBF88B904)));
extern volatile uint32_t        C1FIFOCI22SET __attribute__((section("sfrs"),address(0xBF88B908)));
extern volatile uint32_t        C1FIFOCI22INV __attribute__((section("sfrs"),address(0xBF88B90C)));
#define C1FIFOCON23 C1FIFOCON23
extern volatile uint32_t   C1FIFOCON23 __attribute__((section("sfrs"), address(0xBF88B910)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON23bits_t;
extern volatile __C1FIFOCON23bits_t C1FIFOCON23bits __asm__ ("C1FIFOCON23") __attribute__((section("sfrs"), address(0xBF88B910)));
extern volatile uint32_t        C1FIFOCON23CLR __attribute__((section("sfrs"),address(0xBF88B914)));
extern volatile uint32_t        C1FIFOCON23SET __attribute__((section("sfrs"),address(0xBF88B918)));
extern volatile uint32_t        C1FIFOCON23INV __attribute__((section("sfrs"),address(0xBF88B91C)));
#define C1FIFOINT23 C1FIFOINT23
extern volatile uint32_t   C1FIFOINT23 __attribute__((section("sfrs"), address(0xBF88B920)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT23bits_t;
extern volatile __C1FIFOINT23bits_t C1FIFOINT23bits __asm__ ("C1FIFOINT23") __attribute__((section("sfrs"), address(0xBF88B920)));
extern volatile uint32_t        C1FIFOINT23CLR __attribute__((section("sfrs"),address(0xBF88B924)));
extern volatile uint32_t        C1FIFOINT23SET __attribute__((section("sfrs"),address(0xBF88B928)));
extern volatile uint32_t        C1FIFOINT23INV __attribute__((section("sfrs"),address(0xBF88B92C)));
#define C1FIFOUA23 C1FIFOUA23
extern volatile uint32_t   C1FIFOUA23 __attribute__((section("sfrs"), address(0xBF88B930)));
extern volatile uint32_t        C1FIFOUA23CLR __attribute__((section("sfrs"),address(0xBF88B934)));
extern volatile uint32_t        C1FIFOUA23SET __attribute__((section("sfrs"),address(0xBF88B938)));
extern volatile uint32_t        C1FIFOUA23INV __attribute__((section("sfrs"),address(0xBF88B93C)));
#define C1FIFOCI23 C1FIFOCI23
extern volatile uint32_t   C1FIFOCI23 __attribute__((section("sfrs"), address(0xBF88B940)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI23bits_t;
extern volatile __C1FIFOCI23bits_t C1FIFOCI23bits __asm__ ("C1FIFOCI23") __attribute__((section("sfrs"), address(0xBF88B940)));
extern volatile uint32_t        C1FIFOCI23CLR __attribute__((section("sfrs"),address(0xBF88B944)));
extern volatile uint32_t        C1FIFOCI23SET __attribute__((section("sfrs"),address(0xBF88B948)));
extern volatile uint32_t        C1FIFOCI23INV __attribute__((section("sfrs"),address(0xBF88B94C)));
#define C1FIFOCON24 C1FIFOCON24
extern volatile uint32_t   C1FIFOCON24 __attribute__((section("sfrs"), address(0xBF88B950)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON24bits_t;
extern volatile __C1FIFOCON24bits_t C1FIFOCON24bits __asm__ ("C1FIFOCON24") __attribute__((section("sfrs"), address(0xBF88B950)));
extern volatile uint32_t        C1FIFOCON24CLR __attribute__((section("sfrs"),address(0xBF88B954)));
extern volatile uint32_t        C1FIFOCON24SET __attribute__((section("sfrs"),address(0xBF88B958)));
extern volatile uint32_t        C1FIFOCON24INV __attribute__((section("sfrs"),address(0xBF88B95C)));
#define C1FIFOINT24 C1FIFOINT24
extern volatile uint32_t   C1FIFOINT24 __attribute__((section("sfrs"), address(0xBF88B960)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT24bits_t;
extern volatile __C1FIFOINT24bits_t C1FIFOINT24bits __asm__ ("C1FIFOINT24") __attribute__((section("sfrs"), address(0xBF88B960)));
extern volatile uint32_t        C1FIFOINT24CLR __attribute__((section("sfrs"),address(0xBF88B964)));
extern volatile uint32_t        C1FIFOINT24SET __attribute__((section("sfrs"),address(0xBF88B968)));
extern volatile uint32_t        C1FIFOINT24INV __attribute__((section("sfrs"),address(0xBF88B96C)));
#define C1FIFOUA24 C1FIFOUA24
extern volatile uint32_t   C1FIFOUA24 __attribute__((section("sfrs"), address(0xBF88B970)));
extern volatile uint32_t        C1FIFOUA24CLR __attribute__((section("sfrs"),address(0xBF88B974)));
extern volatile uint32_t        C1FIFOUA24SET __attribute__((section("sfrs"),address(0xBF88B978)));
extern volatile uint32_t        C1FIFOUA24INV __attribute__((section("sfrs"),address(0xBF88B97C)));
#define C1FIFOCI24 C1FIFOCI24
extern volatile uint32_t   C1FIFOCI24 __attribute__((section("sfrs"), address(0xBF88B980)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI24bits_t;
